public class Stringcass2 {
  public static void main (String [] args) {
    String 商店名稱 = "方方土按摩" ;
    String 服務1 = "精油按摩" ;
    String 服務2 = "按摩諮詢" ;
    int 價格1 = 600 ;
    int 價格2 = 300 ;
    int 折扣1 = (價格1*6)*90/100 ;
    int 折扣2 = (價格1*6+價格2)*80/100 ;
    System.out.println(
      "客人你好，歡迎來到" + "\"" + 商店名稱 + "\"" + "，我們服務的項目有" + 服務1 + "、" + 服務2 + 
       "\n" + 服務1 + "的價格為每小時" + 價格1 + "元" +
       "\n" + 服務2 + "的價格為每小時" + 價格2 + "元" +
       "\n如果您一次購買" + 服務1 + "6小時的話，價格為" + "" + 折扣1 + "元" +
       "\n若是再搭配" + 服務2 + "，價格為" + "" + 折扣2 + "元" +
       "\n歡迎來電洽詢") ;
  }
}